//经典算法题:千鸡百钱
//1000块钱,要买100只鸡
//公鸡每只50块
//母鸡每只30块
//小鸡每3只10块
//问:一共有多少种买法
#include<iostream>
#include<Windows.h>
using namespace std;
int main(void){
	//i为公鸡数,j为母鸡数,k为小鸡数
	for(int i =1;i<=20;i++){
		for(int j=1;j<=33;j++){
			for(int k=1;k<=99;k++){
				if(i+j+k == 100 && k%3 == 0 && i*50+j*30+k/3*10 == 1000){
					cout<<"公鸡:"<<i<<"母鸡:"<<j<<"小鸡:"<<k<<endl;
				}
			}
		}
	}
	system("pause");
	return 0;
}
/*优化:小鸡数不需要再循环了,直接100-i-j.
所以k直接确定,那么i+j+k==100可以直接删除.优化之前要循环几万次,现在只需循环660次.
其实还能再优化,因为公鸡不可能20只,母鸡也不可能33只,还能再减去点